using System;
using System.Linq;
using System.Text;
using System.IO;

namespace OthelloAI.Condingame
{
    public class DataEncoding
    {
        public const string DATA = @"燠㗂뇣擀㗭냅藥㗈날无倍낆株觥顋邌吐聄臠㖫鐯墋敎谏胭傭蕠烣屌ꢌ䯍肏갎嗨恌뀃屍氏簎沨淨袎耮柰簍硊栏谏瀏炏琐氭䰯간覥䱍灌糄㷏衮鑰䐯琌烍堏萏耭㖏頎蠏琐砎籬㐯琐屎梏砐襈塋禀肨吏뀎琋甯透ꁎ倏簊氎瀏鰏㯯ꡭ蠏栍瀐谎氫逯簏耏瀏砏尭氏谤瀎뀯小寯逐耏瓮琏ꀍ餌搏鰎萃뇦逬갏栐砏蠏砏氏可瀏琐珯毯鿭ꁎ倏砏萍氯萏砯瀏搌埯瀏鰏䯯塯萏琐琐琐簍栏琏䰏氏琏簎忯砅敪㡏遏䠭嵯鐏炎堮琅磍氏搮琮槮耏䰏栐瀏萯堏琏氯呐琐預栐听䐭瀏鐏耮偐砏䱍氏琎籎瀏瀏桏涏簐透瀐耏透栏琐琐琐琐簐毰鐍灌透㐏籅㲯琏蠐栐怎䡏砏瀏瀰僰耏逐琐琏䔃摮氎㢏搯琏姬䢏㗠狵嚔蝾刍丰孱达矸迟勎䬬漲㩭䈍坱潖挍澴逛箹鐙潓毴籖鯿蠖鑟垒䮐篔䮏匰侰篲砑翷侯反寲䌋伊垰殓杮氒矔矕耴控枭濭螖箏貔螹箮谔濐寐寱鐗翳韹宱侎宱坯地氶糓濰硵迷翹頵澱歱砗鐼讖豹倐揰柯䰏柰栐珯氐瀐㐐揯氏㿯可忰寰柯柰柰濯琐寰揯谏瀐揯砐䏯搐柯埯氐搏柯氏瀏㟰堏毰㏯后埰濰栏忰瀐琐瀐可怏瀏珯揯搏忯毰珯堏濯栏琏砐矰怏栏瀐忯柯矰簐瀐琐氐瀏濯柰珰耐簐萏耐蠑篯韯氐瀐矯ꀐ萏逐柰濯珰柰忯濰耐俯砐꯰篯述谐耐耐뀐诰ꐐ萏琐氐揯柯毯韯蠐韰琐琏珰柯寐珰菰柰砏鐏矰耏柯毰琐诰濰诰꯯菰菰篰簐砐預萏蟰砏珯矰砐琐谏诰柰逐뀐述預萐簏蠐뀐菰預硌衰後瞰萱垉瑮貕掬潰伧葒荏尰濰柔柱濋硒殇镔柏炰篑砕毴萑仰嬧毒氏澭歭玐桐珑㪧㻉氩澮梏殐瀱毑班嫪掊砉羳瀰篒殯濯玮鳞毴捲羰毱琑濌聕汓鑶瓐磗瀑汒簱氏染篍꒛糏ꂺ濏琲篳殱琳簭彰枏螰砏耳珯珮寎睑䮎亮氏瀮寲珯毰掯歭枏忌葑矴簑逓珰柑潮枰忰毑濐矒揯篯珯殑垌孬氍毮摱砑寐掮柯垩篩篲篓濰箯濐濐篐箰毐忯俰砑矮砰珶碕瀐忭珯濯揰珯柒殯濌羒母袒玑濰濐杬柎短衶耓菶瑐某珳瀐矑忏衑恎璓澮忲矲柰宑濰違瑐谷萐硴籲砎瀐螱揳后萔毯枰玱矰獏玮毯栐砱籓沓簒瀓珲簏篎珯裐簓砒翲簰瀏翑谗簴濳民玲篪灯籰尭衔栱簊珒瀒石毲殱篰違硏賑蟳硐瞳珒琑菮砐狏揺柍瑱耒紌氏枫卍䎀뇼濰疐砎顲琰篠袶亠ꗰ垰淯瀏簭琰濅㉨枱梔簔毳珮菐栏篐㈄㈇搊碕釷栴玑揋殦㉪娇局넿攴逻澐琎澊걛濊毲提毯硎朐琮篑ꐝ駭疞矲瓱砯㈄嫏箆낿蔭냿琳礑袒䙇矐嬠㚃獏毮珰琏濯耏濯毯㊠㉭硌遱糱琑瀏瀏琍揈婪营豖環簑瀏瀏濬㏱枰瑑蠴菴寮瑯粐琭㊈孮栍ꐲ꧸礕垌毯柩㍠殍搋끿畕萵柯琐濬Ʝ珮琐琮耎恪恎炌筯進硯琐簐璐琐宮氏矍끺硏萳萲瑐耒寫砏忄넿砰瀕寰琐琏柯琐珮純哬褚琏瑰珰华某濩뇛瀭뀻濯璐琐双濯柫㯮瑐瀰鑒矵琪聎籬汲㌫徯瀎葰綴瀐枮忎濭友琏濮顓瑰砏毰琎濮꿒砍簏琮篯瀉孑肎栐낶胰葳篰砰毯㊭柎澧끟碏頷豵粱簏㎫篇䬀眜樐䟒枲瀱瀐菑簯琏孱枔掵栐每砮籯瀮砍耖瞔菷毯粎籯砲氍联獰木紱柯忏氍琮聎瞎伒垔梓伍䫬珏民柒氵矒箌澮獏廬玍砮菓玲睑柌譴瑰珑毰蠮翭瞵忐摓灓琏濐毰揕砱聹讶欭讵耏砐螏鰴潯迵杲珯柯忯珯珯砏珯濯坬宍氏忐濰濯砏琏濮玕謱羑栏濰琑矰琐濯掱捳糏柰柏瀌砏簱瀐㬍侐佰䋭卮揱俓瑑灖珎砎氋宪忐矱翰萎砯歐蟭氐濐珒濮矮矐濐呒䲯忰毰汒揎笐捋篵迖羌翰濮玐枮蜒獌眏耘簐濯忰砏琏诐琏珰掔描瀱每灐瀏砏瀏琐诗琒逕琐瑐濯耑琐琐许俱沯氒瞯矮瀏萒濐垏琰摳埵毕瑷瑑粓瑲耑菳衎毴柱粸簯耑硐螵矈譳瑐濑柮蠯籏玳毱肎栳琍珲怑蠑汓石頷谑顓蟭睭耐ꠖ运迳疥䰭颎栩峯鐏磬呏蠨火氏鐏氎磭簏砎栐砎碋吏萏栯瀯簐硏栏灨灍琏萏揯瀰萏桎瀏鐎瀊嬬愎武蟐蠩琏耭䣐箋筋琌猦㎩徊炯栦忐硭怏瀏琎摯簏萐怐琎萱枳ꃏ琱棐籓宑籓衴胖潪鑖氳毫蠳餕寒灑砮栏蠏瀏硯簏簏栐珮瀏瀐矰栐耏琐琏瀐砏琏琏琏琏瀏琐瀏瀏琌琏谏氐珯琐琐氯瀐透埍䌍甋匨枑꯱㟐澰吒竎捐栭漍蠑珒迵葷谑簏氏琏砏瀏琏琏瀐琏揠徐嬔彏瞬歎猘揮捭韶꿋谐耒辯螒鐫塕澑灎小簏怏汏簏瀏氏瀍耏瀏砏琏璏琐琏瀐琏砐氏琐砏氐琐砐瀐瀏瀏瀏琏琏氐琏瀏瀐琏䰅惒濒獹琕澐㛫䰸垱鑖快聗㑑蠳耳鏻岓袵砏砐堏砎尯瀏砐瀐瀏葲屏汕ꮰ忏茮塴垲矏貸揳鑘琏螯簑걷吐萱締㗠뇠瀠㷦냃积㗦녠淠䐊끤柢跠飥贉䰐貀觠㗊꓏僧嶫頏膐䵪燠撠哊颉㮉烏꟭左墉豠儇栎鐬璠締腇聭怐耨灦怮顏可洏琐瑫傍끠緩壬裪贠凬袍鵐㲏砉番䠮耯瑫㗪ꑍ蠯琐簉褦䢮簯恮慎耏緥啃痠攠䐭꠬獆旭鏪鲭䒏蠣倌毯逍㎎ꄋ鏭寬氐韌炇裎耯蠏汏耏沫怭貀吩낮屎䯎衏菮懫灎鐨緡倍鳇蜀뇠ꭠꐋ䰐鰉萋瀎蠏䟏桏琐篌埮꽣铍䀮籎蠌瑏蟯粯栯蠋堭濯谏䯎㤯蠏琐琐琐葊瀏耏㯎恮琏葊吏뀠緦㴍颮吪妭頬由僎聠楊栎屪琪凬籎䰯栐砭钏偏琐袏傯砏끒堰屇䒊摍ꀭ氫䃯簯呯搯瀌攌栏氏僌㗭谏鑐氐蠌萯搏琏琐琐琐琐忰뀇裬葌吭蒠䔮瀮꠰怰怍僎琏瀯恮㗵逯頑琐琎无祉葍㓭售透己㗮㗠漴婱莛副丏弯頜萹鐟勎䋍媱㘫㸋伮漳廭歔頻菺頺澕獴肙걿逘ꃟ孲䎏枒䎐䚑厐菲翲菺佯䝬嬲㺉䩪厱獱櫭濔菖翖蠗徆欭琒迷獭豶莵枒谴宰嫰忐頕蠔頼徏卍徲伯华瑷腓环碖鏶菹顖歑澓矹ꁝ试邽堐忯柰䯯怐揯砏毯瀐㿯揯柯㟰䏎埯揰揰寯琐濯琐埰忯鰐翯濐簰㿯揯搏䯯忯寯濯毯瀏㐏䏯俯㏏㾋寑忰垏揎矰濯琐俯侍柰珐微母揯搐砐䟯埰柰砐琐簐埯揯毯埰某耒萐珯瀐琐瀐砐寰毐萑谱翏蠒萏篰蟰毰濯濰ꀐ谐谐濰珰珯怏埯瀐蠐䯰砐ꏰ篰蠐耐砐耐꿱逐꠱矰濰簐柰揯柰鯰诰預瀏矯琐忏孰民菰枰耑韰篰萐栐柰濱鐐某蟱ꀐ篰萐矯篰篰鰐逐谐濰珰琐毰砱遒預簑頴뀐鯰ꐐ菰菑谔뀑讱ꡓ灬逓宮怌碑徉璯蒲濋圩䩧臵猬呯羒箳卐瞋蒗捂ꃚ箰梱鍵研毑鯏㺌坌瀏籏珑潯濯揱簑㈆㈈寈迲禸簓析某殨䛈囧柅蠿烳鏗殏琐歫걝濱鑕珰澍箯揍琑玮ꑻ綱蕻聑糔环庌匐獩낿赑넟硓泒簔宭殯次䬍澰珒砏瑑篮柮栐氏䋧㈮琬濯墓箰柯宯箋枯拫蠰萷瑳鏸珯枰缮垏栐毐透钓俍萏篐殎㪭䪊忋矔楴瑶住嬎揍䍩杫毌诹蓴蟷枲琑玭蟑珰砐毱某毰氐毐耑灐恮毯枮琴栐佯枑揉钘硏簕玴桲瞳匭掍挃鑹瀯矲琯琰珱氐瀰毭砒堎糷揯桵珒徏圏玬鴙沏뀾翰璑耑濯瀳诋忏揱砏矰澐篑篯矰矱匭掐栏邖藘聴某枑簭濪矰琎蠕蒳簴民砳澮豒琏珰氐蟳某損鱱侫곴烑璴簒水濰嬰匏殊갹籱遺逖胓蟶掏獫箇玑瘯瀜搏珰瀐篯琐瀐亪䪠駿毯熐瀐砐琐瀀锚刀괺濰燐濰砏珰瀃㈎䜎珲篳葐民诐蟯瀎㈋㈃仳菓ꇾ氚茏眦境㙰䘄瀠뇿邳ꟛ羯迭ꏣ꿿柱領柱硏堏潯珰氎鏜緲臿塑䧰塱㈀䘐尨끟试넟尘跌紖嚍眯䫀㈄苯砎汑簐琐耐琐砏㈀㈍碭盱裑琑珰琐瀐瑰娈葇ꢛ瓱筳矰珰琋㎐䯏毰毲谱瀐蠐矯矰㈌㈎很蹳뇿臿利掎揯㌃䋊專끟ꗸ谙毯篯萈ꎴ蟱谑砒籐氐華珰毯鴖瑐递矰嵱瀑孮澯徆녿褔꠿萺鐱蝒徬矯垀넿械揸搐琐瀐忍珰栏珏梪趟瀐灯瀐㻭掳濧뇿砪끟瀐珰琐揖濯忈㍯䞮某琐耏栐濏矯矮㉧㊌孉近鷹濱嬎寑怎䍀侰矱ꀷ赶琔枱篰韪뀵珐鐱柰珰栐矐珰修뀸覑ꂸ砐惰濐㈍弎亠낟肳뀿裿衒矲䟙橢㩠獓潯砑怌籑珰砮栐柏㻭嬓朷瀏琏琏珰濯珨鯽荶輶瀏環珰矯瀐琐仭挰揌据捯瀰柮枯澮䋬伳揕彯廮琲栍捴灒请纐玏砲皫箱葔獰殲这耳耗籑珲簱衖硌菴挒栴培忐獲瀒獳埒籹ꀸ绮韷琯萯羴頙玍逵掱耰簏蟰褓簏籑珱澮伒掰珏毯瀰濰琏濰濮辶翯矏矰硐琒瀐琐琎䍌澱琒寮忏忎毎毐毫㉉㍭㾱㪎䎳叴寲援炻诱蝏簍徱捍睏石菑瞑琑透石菲簐濏砱砎簕忯悒吵毐珯揎橎徍硗鱙鍬讱翮缇彫诒誉茳耑怒濎氭珲砏尯柱宊匐柑栰濮瑏瀏堐濐瀎鏷珱羳濯瀐珰矰珰琏澓枭揯忰据栎柍矱徬䌏厱岖杴枵梸柱蒕泻過荮篬矶漱萴瑑聓翐貕篑萵葏粒珰耱聑琑影呐桵澏琱掲罴瑕籵냟鮐걸箲笌潮ꯙ鞯鯲翑䀰뀏毯瀏矰珰栐簏濓柍簫珰班砭矰梭硑枓汭聯珰栭葌毰桯瑎䯎宎柬母掍砍翑簎濲㉨㸧柍䫭曌瑌猍侪氱圊滦濍耒湮羏蠏琬柔鐱灲萴毲枮瀭簑碐籶葴聎禚忑澒氲瞎柳籙끜粒ꤝ瀚華鐳萴灱粜蠐氏翯萐珰琏翯琏瀐砐珰琏瀏瀐濯琐珰琐耏濰篰琐瀐琐珯瀐琐䠰忮栍徱徎琭珒濋琱㋭㫬宰䌭拏染彎桳怸䍭歫栮琳蜲辱簐碒硘鐏矯菴濒每栮蠳璍粕篰掬琐殎檮罊杭毯搔蠰罫篱箎隮螮籓尰矸柰揰篯搐瀏瀏毯瀏琏忯柰砏柰瀏琐濯珯瀏瀏濰珰濰濯琐瀐珰珯㿏彰濮叏枍瀍毰琰簲忰就搳怮滰翯氭桕堸氯籋籑簱缑習萲岕瑻ꀏ籐耐毱氱氱菒硍聏颳碭袔搏猯潬珲呒寶낸诮飕逷蛯讏顶揎籘絢㗠뇠池㷣냁緭㗧ꇠ槠䟨넀歠藠곀蔅倐颠臠㗨굯儅嗩ꀏ練䗨淠桀壈铈㭥梍꿫懥棉璠啣揮硊池痠赡貪搐葁硄搮鲎䯮洯琐紉䢋낀觨唊蔩酠懩邋馒㳯聈涪䠬豮炦㗧끊豐琐耆酣峭葏咫巫萏痨䷠燠攁倬ꑪ挅槫鿈鄭䢭肁䟩毯谋㌌覉鏌怪瀐魉瓃蔭貏耎泯簏甬悋脠叇饬屫㾋萯菭旨粭碦淠䠌絠筀균긠곋䐐꿠螧琯谮㮎桯琐钊倍껠賬䑮衫菫瓏蟮褌摮鱉忬濯萏卮㕏谐琐琐琐遅瀮蠯㼫呭砏飉倎꽠緥䃬鳭恇嶫鱉臗䥏裀旨搌屧砦旧聬栮氐耪锏呯簰糏兓簏ꑶ䲒璣周摫遌栧㳮葍惐恐瀫斈搎琭䣉㗯鰮颔氐ꀋ籏栏砐琐琐琐簔寰꿣镯籫岧蔀妫簭꒳呰栌嵎氎瀮䂊㗰顎鐱琐而燠秄ꃍ㒫㷭鐏槵㗻㗠毑捑羵䚮剰孑逗菹逼䛭䊮媱㹬㸪勮獒拭潴逺萻鱛珔玵聹ꢝ逸꒿捯䝰殲䎎䪐厰菲翳蟻协䬌弰㺌亩厑獲曮濑菷翷谘授本珱逘潎衵羵殕谕宱廑掮鰶谖逜孰匏挱匎卯硗胳玏碗迹蟸遙潳濒硘꒜蟔铛毯忯柯俯寯忰砐濰濰䟯揯柯㿯䎎収毯揯忮琐濰矰寰忯逐萐珰菒寯忯揰䟯可可矰瀐濯㿮䏮䯯㞎䞉忑柰圮毎濰瀏珱俯伬描矱嬍殊柯柰珰䟯埯埯篯珰簐寰柯柰俐提簳耐濎篰矰濰琐忰毐菱蟒羍谑矰濰蟯柰濐琏鰐逐預毰毯矰揯提氐萏可耑逐簐诰篯簐耑ꠐ鐰ꑕ矰珰蠐毯描濰ꀐ述鐑珰珯矰寐圱瀒蟰掏簐預耐谐柯每濑鐐殮莱蟯簐蠏矰珰砐ꀐ鐰頑砏珰毰毐砲遵頑矱鐶ꐐ鿱ꐑ菑矐逖끕蝑ꀲ肫翐掯氋璲步硯礔玧媦仆臸殬墐瞐民弱箋蓘嫀ꄘ毐棒蟶琓毳逌㊋杭琎短瀰濌瀏氐琎㈂㈅埥蝳臺萷朰捎玩䌰嘢揀鳟硵鿗殯揎捇걾琐聵珰濭篯描瑱珌鞶臱藿石腗篱万䊐歊넟裑녿篷畒葖佱弭扠匈澯砐砐灐矮珯濯琐㈀㈍灋瞏煔澰毰提澫栓扇遍鱘电韘琑毐第掎濮濮耐赔寈耏珰玪㨌䈋栫荒熔磺䫏曎叕䌩杇矦頿襶逻掱濐杌音琐萲砐瀰珯栏毰耑灐炯琒濐硔毰坭澐寪鲗碯類翘炒羔伌彌嫠飹瀏琒毯汐琐柯瀱濮睎倭蔺描梖篲仭庱獦꧿泍끟砐璲耑氖瀲箅䎰揍琐珯柏矲珰矰篯介䫍栌鰘觸豴杰枓珋珌濐琋逴贑琴濲矰歭耒濰砰瀐粔氏柮钱捄ꁗ浲礸矓瑳矑亏嫍宆겿瓯꒿頺鎔簘彔欩澅瞒蚏尺砐珏濯栐珰濯䫆㫃觺枭攲氏拯賓搀郺噀꧶砹觯安簔簯菃㉫歯毮逕氐琐濏濯濯㈋㨇䠳県跿砽幯囩塃坒戀殀뇿錒꽴萵玊蝀뀿籰砘琑琐砐孮珐珱罶釵燿捬巶炴㈀㊔䰕낟靯ꢿ耻襭颶搳檎娀㈂櫯栌瑑琏瀐氐濰濰㈀㈎敌婭蓱毰枏簰氍瑑刄硨넛糱狓玐砏澥㎭華柮蠑翰琐氐珰搑㈉㈇倠騉ꇿ觿䘂䟳䐘㎇护杀녿괷꾼澴玏笠魳琏忰蠑簯矰濯栏忱璭禶桰欍嶓现㌊䭱双낼臭낟鲿霏긬塱狨戀녿肰砿砏琐濯忬珰瀏篏粐醿氳煓毰㊊濘栊뇿粈낿簔聯毯瑜篰寋㾰鏐琏萐翐簐揯柯栏㌨㈈沠談藿瓘䋍䁺偶璇珮瞆낚鲲鎳砖珲羂끳簏怑矯豏矰宏毰忰끕觵禜潐慶矔㈈㋐䌥낟釭낿駿麫ꛮ䁿娀䘀歱揱篰矐濎矯琐濱瀯䋭排枕砑珎珰琏澰毥鱹螓蝳氰磑琒珯濱砲完枮母每珲搌毐砒濬㼫侑搵杳圏恔恮濳灱鐶纭瞍枒扊柮徳篲氰萔碯瑑琒簱每矓蒑瞲坎梴屚翑聎歰篶耯肺ꑖ筏韵簎珌毑讴羍谖濑翰濏簏硎矰瀯描簮佯揲耏珲琯珱氎毐枮迳聱耍簏砯耓簐澰珑徎濑瑏瀎瀐毐珲珯毮㊩㮭䟱㩮㐔呓杳栔磙葱譋蟌掑挌澬濲篰澏濰簮矰珱硯濯翱篎濱后撐咖箱簑瀒狰濯灕鑔譫诐箱狈欩菱绨茏簲瀏揰毮汯萑搏柑珮卯柏摎揯毯簒忮捰瀏鐴瀐翱瀐簱琒澯殯琐毰濐搮毭玑氐毯珰瀬䭎寰墔従尶擸氳籶瓙鲮蝍翋琖睬琱殲篱枯聒砍矱篑瑏琒聰砑澒埍咱悷瞰硲瀒羕搯璕냼鯐걔篖漫潏ꐚ鯊ꏑ澰析耳据朎析簴琔籗硘据衔杯捈枌簸瑔聳猲宎籓札卌殏蠔瑔裕班捎矐矌廮玎篲掏珱乫帤现捎晍殯歑坍珳朋嫤母澎幬罱簑捍澔瀑珑簵枰殱蠲砳氒衕璵瀱腼柯毓聵珑毲蠽颽珱褽瀒瞲衷萵研萝矏揮琑掮嬬濏琲每翵簰濯篰濯欭珬砱玐篱毮殭簱毯捌矯砑濏聕箰柍硒枮寑篎簲毯篰㋬䌌砑䌭扰睱掯吔換嬪嬫硊瞏竒鎑萐灶砻鑒琐篳柯枮譯谑某蟒簏潮硑每瘫缫矯掐杶谐澈耑菏鉯霮珱殴潹簑柮萲澐杮矑萒砲蓘濐毯簰柏挮珯琱琰聶提柯瀲濏描琑瀐琑粗垑掮瀐忏厑篒珰忔瀱垰寑璖揯滴瞲恐䱗䠼栯濭瑴瀱缵篲籒撘桾毱环粕掐枰萐聱搑蠲硳沭胴寰滑筏研䯴忚뀷珰ꂗ菳苏錯鱗柴萼灎璭琈蒏椪逩搌哎瓥焬厬钩诊馧衧聩埰鎦璇太賏惍啑谐悳愍壡殇袭葍玫氭鏌擉炮粅祌氎葋砈귣炅钍栐莦琈氮葯佮摰琐蒮堍鼁紒悍恫蓈煊瀌炐䱱籮泮揎砮汬㷴頮週琐蟌灆桮耯偬慐耏泭涉䆀累吭題褌始Ɡ璍偮磋柬毮谍歎惋魭瞫毰軫沉烬葯搯峯耏峒悊奢柫閭籌忋毮Ɡ憫泎浪痭䰉覥粩藣錀鳱俰꾪萍琯豯䎎垑琐颓䭭ꪧ蔒摍砌砍梎菎籮悎袎垎濏矯嬯㑳谑琐琐琐砉瑎籐䫭㭳砐邏䯎ꩀ揨䡭貎砍氪鐬恈㲭衡瓌栎硩诪趦碋簮柰诪璏塏簰梱墷簏瑔䱴豨守沏葭毫怌簬桮桐硌椎濮瀬䰌㷾顑鐷濰꼳蠱瀐砐琐琐琐翔徐꽋炐撎岆粀胆簫肑䱲砯塯怍汎䞪㥖鱐鐓琐迏瀠敢铎㰈㣑鰏泉䧷斠瑍揯耱氍掱珓砮殑篱氪寎珮律宭歏瑎坎殏碯氰衑瑌砳萶聲琔豲掫厭矏宫卮枏氮掰瞱揪压澎嬬宫欭砱掑珍毮揰篒垇揌澎珯某簎肒砱顳琯瀑耑袒簴違琱枲翱毰汐篓蓵瀳聱粱硳邓毯璒耔貕籖貴籐栏萰矯炏砐蠰瀐蠍珮柰矯掮埮濎簐揯濌砰砏萏簏硰逐耰瀑萏瀏栏砏毯搎栏砐瀐翯梑怎琮柰棐篲硲汔葯搐栐砐寯摏矏琐氱簍砰氏耐濯搯瀐簐氏萐氏搏琏寏埭殎砐描珊瀐柰簐描汯翏耒琑蠯栍忯簏寎尮矰瀏氏砋柮忯濯忏搎珮揯俯濭氏氐簐氏硑蠐簐瀑衎濯柯矯氏忏篯珰琐耐矮每矰柎怎玮耑揰篭砏琐菰毯碐翰萱琳谯砏濯耏毯毐矰矰簐耏耐濯砐濎桎翎谐毰菬瞫矰蠏澍柭睌篮殯菪畅粨炪紦燫颀椦䷊沀殣寠釮耆肃邅糊㡈袃綐尠釱粨妊겭椮唩敉㼧垮瀎歪甍瞭搪尭者㩠婉傤纩뇤爊埨卉漠㯭嘥搀养檎转只柍潄ꤸ灏遒肭異葎碲灲硆ꀐ藮觟遰疷蒐蹃吵耸ꇼ饋袼裭燶餕泻洟䥠簪箯谯遯裯蟏蠯氏逊幣㉍衬曮憎莏蠏忯辨郵檪豯꒖膐蟳頱瀍萃菏矰砏鏱铰珯預瀏诮歳昍鑣齕鱟闿靍惕豞菮漊砀끚酳頒鐐瀑魦뀲琏耐頑葯耐頰琐萐萎浐耓譱㓖翏箭澏玧끙秏顟逘忐銦鐙孪글泐尯搒導咯矯䰌忰吨䬪堌紘䯎慯琯㭌徑宦膺岬끝寯唱萏灘寱蠤㎏毯濯䯯揯濯可毯怎㋫䘍瀃亯㧿貴仯兘菮對柏砈氳甲矵侳氏꼧忲瀏氐俯尰濯䟎濯埫宱积瓘䯯儔珯㋌宎徥玶奮籟傖娌筨㬗一㙋珒描習匌剫䭫颖颴鲜佉䟪塌㊌㨇䊈濏囍挌餘鲎ꓐ珲聸籺끺ꄝꔟ挬环珎䮎䭍䯍週萑濲䝎㸩䟀㼬㽉孬肓遑忓递笨矡澮玬矱ꂘ譯頖粖琱砒埌现寰ꐓ遒页卯淯椵䋊住埴瀲濑桑鰴鷱꒞枋鞱寎걸蠶ꃓ徍珯濯搏描篯砐濰柮䛫佲寯㮰㹮叮氐毰埯翱螑矬珱獰蟲耐篯翳䞮匏濭䮫䏓蟲獰掐忱㛤㈍埦㈃㏒男嫨礛㱲濧昊氅匫枒迴羭粗翓毯琑某树玏谑琏瀐短呱梖瀕䓳䘭埍砯砐毅螐磖途蒐踋绬鑑瞍譅蒒瀰珰珯葰矯簐瀐蠑寱汏忑揯徰柰濐埏濴ꁷ耰韔矰谰矰ꐐ谰ꑛ耱砰濯氏瀯濰箯宰瀕堐䭰歊厍兖氳寋桷呞谮睯眬栱腒澮鮨蟲ꀝ钑耯谗珳翰簳飓寏龑焰畐粟山歐曫賕伐箓ꦙ贰낟脺ꎍ橧뇿滥꽓矑筱殷濰玓柋濎肓玕挩垇觾毱紐毯每砏濫粶幠郳簰硰氎矰砰揩㚆弑篨瀍宭翮殭揵矎㈇䘑䠑暉脖矴漮媦毣堔布尠駿癊轈睰枫揥곝棰耙砒氱羐琎瀯逳蜯駮疿瀓綏碑䨀呵梺넿鯏鏿砷疑赻胜澮孇䋦盰枪瀯澰揍毐矰殮㚡㋯攰术頑珯濯琏濮摒分撉褳碱玳珯濯毭㏋歭珩濌埌瀎寍搔篓㊊㈍封蘇緿觿稀慙梟㱑戉埠녻鲑鎱毰瀲毨頳屎篖蠰某荱胑珫螯葍藰萻筑脱矯忌每殫곚緰ꂟ褞蜎踦怿氎庠ꓺ礒濸琑習栐籏硳珳羬賊馟瀐琐濰孩澒濉ꖻ篧끙簐琐瀐簶琰䯑䎌捱葬掩忱硎埬忖矰㛆䈋氠舊藽琲嚋夛尘摬滮氀週蓳砒枳汏揆낔烐矶聱枰羭硱毮蠯꭯駯紿矰磒玎㈧垯寍낾趯끟懿縈芃壿戀婀羴瀒矱彯玑瀮蟳灎篓㈅仏漌捍狲琎蒷玧玉녿籸頛扪棑甒耵琍濙㜊徱澍孌析汊葑柌澏㊉䌏彯䛬嚍栮瑳毋氮進皮狋坬扊柌萲濌潮ꢗ瑒蠔殍珳粐衵籭矕反泗恙揭瑓灰籖籐肛냛豔ꀘ澭琯胑ꂚ衎逼矰讱濰殐濐毯琐瀐毲㋋勯玭䞯杏濭珳濎珮뀸簷習瞑析簔蟱氰濔䠋矱矰半枲摌糕沋睰㋇㝰叮㈅㌱䐭硔碲糹葍輋茨弬媌筩蒓硎玓ꁲ籲達捭掰班聳瀪现届怴台徭振殨珏瑓瑗꣘鎮魱歍暊歆ꁵ蟮靵述矰毰珏莰簏蠒砐珴㋍掐杍徰歑瀐揲殏篲낛灒逗濐琰簱鰒砰篵㾬卮枭後枱氭豴硐翓㜨䟔倐䍋䮒吮璳甖璚蒬诐罭栯曭殯衳磲蠗频氱珏捬氓璌鲴硫篓堍悖屶掌澱瀭籴河粙넚逯꿵潯狈玊넾颍꾷瑌碍瀪蒮烥翩搩棰煊洪埋胈翎赤蠅籪叐鞄炇椊貰岭喓逐桱崏夣瀈璬砫砪栊螫撉沮楅祮柭聬硈闣籄貭忰轣琇灎蒏坮恰琐蓌堍黠甑沬汪蓊絨篋沍峱糎焎揬籍梋䷗鐰葓琐蟬琥炍葯呫懑萏瓏涋冀碮堫葬粭夨韫氮屯焬毊毭而捎壈魌瞬柰蹪汊焌葯启奐萐悓泭嗢濋腫琫揪忬鮊夊森嗪疭䠦編碌臨鏁饲俰꾉菫袍貯坎䰒琐锔伭ꙧ蓒灭蟬瑍热篍籍泎蓰微濎珯地㐹蠓琐琐琐矈肎葰勯㎷砐貯佭긁瀪恍貎耎灧蠌栊傏蔄璭損灨螫覣籋谮揰鎧環悏聏桳哼簐簵䱵郩徉摱瑬瀫忉砪灌摑籫椎柬瀫叭䗞鑒葙毰꺒耱氐砱琐琐琐萗孰깫炳沌恤袣责萪粰䣔蒱岮寫桍佩䄖頱耴琐魮瀠焢鵎䟇㢑頏沫嶰攀灍氭碰氭描濱硏濐簲氪寫灮忌徭殐炍掎濏碏氎肎灍瀑耴葑珳術毌揭琏富垍枮汎柯篑掫垪栍彬宋杍瀏捰澎濯柯篰掋掮澎珯掰矯碒琱遱瀮柱簑肒簳違瀐柰簐民树篲聳瀴聒粲籲邳瀑灲耳袔硕貔籰氎葏砏桮珯葑瀰蠮砎毯砏殮忭环簯揯玭籑簏萰萰瑐耐簱瀐萏砏瀯砏濯栯濯琐瀐耐汱搮灎柰撑珰瑓栳耐氰瀐砐揯怰瞯瀐树篭衐琐耐耏瑏珯萰瀐蠱濯柯珯掯寮澎砐掰瞬砱氏簯殯搏箮簒濯華栍揮簏寍怭珯瀯瀏簭柭揯毯揎搎矯栎忯短瀯氏簏柮灲耑砲瀒葑柎柯砏忯寏珯毯瀐篯濍柯矯枮怯矏砒氒篯琏瀐耐毯瑲萑耒琳蟯珯濯砏毯柏珯氏琐翯矯毯矯珯栏篐萑毱翍篍砏蠯澭氏箍翱澯菬炪璨磪磪疪豄泉敌炂氨垢綏硉粣蠦硪倫肧璭毣駑磌敉颍棍愋榉彩揎瀮簌経瞌汩恍氥䮆廥岇第鶣爆搨卨玤卋媇搧悖殍辍忊揌竦賔瀮袑肬紏衎灯沒炅遵糮脛袐焹蒐謋倳籑鄱鄍贷胍疔鴓梖礿䶣籌箯葯聰瑭螮豯桏遌杩㉬聬漭慫荍豏怏譣葒皪貮颴緳谵豳琯籄菎砏砏頱酰矯鐐瀐诫搴爋蒈韔钜覿辏攵碗篍猪簠갘鵒韵逑氓黫ꁴ砐萰谱蒰蠐蠰琐谏籰椯簓眑㐼羮濐曰澣ꏲ臰钿谗琲鼈遼勤ꘀ灌恍栓寬咍簎怋就摬宮寫炗垌敭琮䭫宏殁礔撍겜寮嗲萏瑖屓蓄䎌柯氏城忯濯可揯揭㿏嘌氁劍㷿镖佐䓵玮柩枯砆珱禒簗寶栱꺍搲氏栐修岐濮䏎氐埇搱燮烚䯏䒖玮㌱圯卤眬愭碟呴括蝆䭰刂䊬砓瀐砑菎弭毯氒矱萷掍怯氎掎廌歮毯捎澰袔萰蠰矰琓耵研琵葺枭澮珎柎彭揎琐矰珲垭劬埡佋垌殏璑萰揱篮眨珧珎澬珱砳瞎篔米琐琒珯濑氐簱砑術柏洰擖殏析水瀒琏灳蠲釲豻濋诐揰页研袒珎矯瀏濯描珯琐瀐琏孌忐揎寯勍揍濯濏揯菐翑班砒瞯簑砏珰篳垮彯氏垉叏翰掰柏树䭈㩭恇㩄㏱礖勩烸䡳濧暪濥孫提诳毮糕珳琏珯濯砑瞯耒瀏濰翰灰炔毳梑噭毌珯砑枈误磳蟴衰鉫缬蒒濫蝩籲琐砑珰瑏砐琐琐萒描瑰揑毯掯珯枰描濳衶籱蟲珰耰砐蟰耰逹灏珯瀯琏栏珯柏描瀳埯坐枈掍咴琰双桵偺琍玐潭民蓱殮篪破谙衳簯蠖翳耰聑铳提鐳礏畎碼琱獏木蒔坯矱鳖褎꡽贘齬滉ꖾ杆꾑矲珏琕琯瀯琐籏瀏瀏按氯礷濯煰珯琏琐珬胖歈矯琏璏瀐砐琏瀃廪澰瀏砰珰琐珯濯珯䈇媱吰抉褚琕猏廇濉琴樅搠醼苫蝩珰濊珆貹砯篶瀏瀯琰珌濯濰漎觯焿濯熑璲娀咶悷ꄟ辰辚瀖由襘裚潯囉㹃曏柬嬆灐濯勥濯瀐㈀㋋夏㨦謱濋坊欮濯寮別梉碬瑲瀓琐珏瀎㜇柏忯濍灏琐忮氏琑㉅㈊倧爀槿臿爀䶛楿㾬爏恀꒸ꐰ鏏翴翶澫蟓揯砑毐瀯谱硏簏琒簯臱砟欒礑籑吱濐搌겹薙ꆿ覟鋎麨生莑芢꥟粰簝鄷珰琐鄸珰琎萑蓌鵝濑瀏琒氌濎殯뇿逊끺蒶瑐研꥜環俶宯矏篰毬澯濰琑忯琏㪧䈃朥爄慼揳嘆㳷尷氬港毀鐐聏珱玷揊毆곸萐萓聯珏砏瀱琏砏鿑藮沿捲瀲弮㝮埍䮎넿颰냟槿稃躃淿樀爀诵琐琐氋毯瀏糐瀏砓㈇媮潬灮漮琎瀏班瀉넟碕鐾琏烎瑱瑉灏瑛䌌漰琋弫嬍汮歰珏硏㊉䌯杮亐仭搰簖砏肐珎眍狈獯湉杫篕矏螬鰷瑯篷濲柎琎遷瑊邗搯焗桘杯恑瀏氓硔璹냝籲韖挰栋毱ꀝ萮遘耑簐瀏珯濰濰瑐瀐琑䌍捏濮寯歯瀏搯瀏濭갸籕篱蠒瑑砓砯琰琔㻆潰瀍午圭琍毎珯氯㊈䎐恐㈆㍱䰍毒硳貶砌蜫笩睏暫歪点翎罯鰵砰簔瞷栎瀒貕碍衕氫炕搒抧䭐掫弭琳瀓냹韏龑札檉櫨顗鏍魐篰琏濰簎矯矰簏砐矱䋎掯殍瀏濏濯徯澏濮ꡛ琱萗篮瑐珰递琐砗䌭歯毮圬札炎欲睯琭㋇㾳俯䫬䰔䱑簵磷磘碍美狪籕瞏殮脹袒韵ꤚ璏翵毒澭琏飔炯钘摰沔岷曋忑树忓炔碸냽翬ꐓ濒圊歌넟ꐏ꾴瓉礬汦腯蓥耇恆愐楉梉栋紪环腅螥肬寐譄磋棆肯擋儵谐瑳崰椄瀪炭瑩肯瑥螈恥椑斨焍琌碌瀋跦莅葮忰鍅珉灭糎匭恰琐胏忰蹤璱碬瑈裫蓄箨栩攔界炰氋硍栋儽讱葔琐蝮琧碋磏屋唕萐粐椲愁胮桊紋裑瓇蠬栍岮敬矬瀰瀪捍棄誆簍某鈈瑉甌琎塮壶萐炔楐慧砍烑徨礊揠謄恇撋姩甏忉泫瀯薒葌賕栐ꎐ篪肏蓏弍㱲琐蒵枋陫袲籬義胍糉羌氨田臲柍殬澯囌㐛研琐琐琐獧璮胑嫍㌲砐袒圊騄栩璉籭肐籂葈忈屭瓈瑮瀭瑨羋蕄翇遏掐謧炐璏矯桑够簑葷崽絪枫悳栬碎柃琈桇栱烪洑殩琫完䖟郗聙栐ꮶ确氲硑琐琐琐籙析꺏璔蓐毆質饀衊璇憘藴撐瀉栌圪䲙葳籖琐ꎎ氆肪袲佊䀒簐瀭悍殢琮桊粭瑎濬砯琮琎硱琬栫瑬毭揬殯瑬掌矯璎瑌粏瑌灐聓籐簒衱柭毬瑎柮徬珎瑎桏砰濬忌氍捯揌杍濰掐澎玮柯珯捭掯环篑掯篏籱瑯蒐瑎氎簮籑瑒衳硒琑簰毱柰矱聴琓耱硰硑衲矰瀱耒衔籕聳砰灌肏硐灍篯葑桐肑籏瀮簮澐怍澏籏微澭硑簯籏聐炰耑簯氱簰籑灎聯砰汎琐簰灑籰灐桏琯瀐汐濰粲栳砐瑑籐簰掭搱珏琰栐篯袔籰蒱耱琮瞮葒瀰耰矯氏瞮枍寯濏簑某珍肓硱耰澮搐矎耱毯翮氍栬碎揭搌篭氮氮瑯氍氍氭栌瀍瞮損枮珌氮氎硎揭瑑萲珱砒萮完揋瀍忍揭矮揮瀐砮掬揍毌掭搐珰琑瀲砐氎瀰簏揎瑲耑簲瀑蟰柮毭琭揍柬珍濮瀏簎濭氎母濮栐矯耲濱篍砯琎耎澬氐瞭砎濰翌烩热瑨瓌涭衉炪惌萡揉揆蓫瑫蓤萆珋怋袊蓑沨脯環棉豰炋愭榉柪毬瑮琌熌箋肋桭氧历彆尦櫮膉樆栈媬猦毉彭栈桯洒荎怋徭缫葱瑍硯灪紏葭硰沔沃聱胎葒葱沷葱菭寔瞇锴鄏蔒裰男袸職絟沤确耮聬貒肍菏萭栯袱掭弭粌嬎璉蝆衎恐輄袓琍籐鳏痗葓蒑硰聈蒎谰簯鳕薔筬衰瓲翌堔狱氎邔菵灷載搒炔葑纫砤ꠚ낎鰑鑱澏輎ꃖ耰蒰道葐鿰育萑辮篎磍翵昐㿹罕坰挰恭鿱葮蓖聽螭齌貼庉ꪆ瑫撋瀑搌尋篮埋怰摋厉残瑌忊攌琌偉忋漁肳桍豖忎営诮蠶嵓碊䌨揌栍忋們揮垭䎮柮䏎嬊搋助㔛裺剮䂶搴灎枯籉螲衮萖瀿捖髲忬氎城富搰澩䎉桲换後涎悼俌䰗琵㊐䯎䀫软籐珹哷瞊莯卬權孰瑏瀍硑萏彪氐搏珯袶宍汯枰柏囉捎柎嫬澐豴耳籑萑破貘耲耔邺忭殮珯濮揌毯瀐毯砲䎪嬌垅䭫捋杰璑箍枰澪眈珈瀏枋殯耓挪箲道琰瑒矱殯砐琱砐蒔炒烱泙掏東硵琰矰碒顴赳蒘矩菲桕ꂓ篳肔寎篮瀏濯殍毮柰瀏簱卭瀰柍厏庪徭柯杮枮谑翲琍珰矐矱矯濏聕䝯掭氮䮨忋濱某毯硒䞍䋌尊㩁䏲法挩桔塵忥曈毅坉枍珱毬璒玓簮砏瀏砍箏萒簎簐谱碐磒琳搫拰殭篏澱歬鑰蒐菱砍軌罌肱殌譎鑒琯琱篰氮琐琑簐籕忐瀰毎毰彭濏濐澏毲钕籱萏簐聱簳逑萳蒹瀯珮瀯桏叮毯灰柏瀴俬宎循徫塔瑑栎汵咗毋殎澫氱琳殰聭灴篶ꂔ簮術篰琮硑ꓳ矐蓔蓯絑絛瑐歱歪賖某瑒頳袌ꃙ絗鍭眮ꗾ歉鞱瑰每琵濮热琌氯瀮籋殩桮鴴汭断班炯棰炮胓䭅肍琉硋菧砫琰萡濌垮硏琱偯琯揎毎柒乧宏恍厮焓箲掎睈掮貳宊瑤禛箬莉栎授殥籑瀮谓耲耐簰玭琮逭孫甋胒聐畲脓湀撴梱蕞萎辯聕米泖鰒揱潇徉杏氍耒愮琲氐瀏汑䌦䞏焮䝭齍矧息撐塬炑䬨殨賭瀵惴瀮栲璍俧硰氫钵綔簯硐棐瀓㍩㍋䣬瘂槽禼稀僽惕搭戅岠꡶낏靌汳寱橤钶砏鑏萑甎ꢷ糯鲏耸篌觫聻溮蔗翏䌪析捆ꐴ籫胴秿鼉驄焜艏言袓磐珹篯矏矮柑矏聦濎裱냓瀮灌珯怦莊漯閹翆頒翏蠫翫꒱泯䑶佫俍灍栨捍䰋徯㛪栉㭩徫摮皆巿摝樀䶜䳶灮曬桠ꂕ腔篔灝怱彇鴱硏班栌獎瞫䜩栎枃蟬藫疿澎留菰㍍墓䐌낵鲈낷巿缈鉨涿幁穠耒瀐濰琐濰琐瀐珯琒㈉抬濮琐猫琐琏珈瀫넿瑒裟琐瓯畳琐珰烚䯎毯毯忯殐瀏氏瀐搎㈄㊇屮匮俍籭搐琰攵猡牄苢砑虨漅裵歍靪鰳簰簑簏耯琏蠐琐萒疒憗禟坋䰲琴掯烴壺녟逬넛簎眧班鱺揬週鐑琐琏耐琑珰濰瀐珱㺫欮瀎垏櫭珯宯澮濮ꁘ砱砒蠓籒砒砐琑珴㝬埰俬埏孰柯小栰快㋮㍰傓㈧㿰寋宭撕灔埦猉笧鍭芉窆蓕殌莮끸꒱頑뀐酱耐뀱谱뀜桭恵撕㺂㼯徊䭉桔寐낸鞭龐莏癄訣ꠔ筪黉濱琐珯耐濰矰砐琐珰坎濰濮瀏濐濯掏濰濮끿琐葛逴璑琴鰸琱聜㌬䞯㿫㟎㉎寮㏯忯䟅㌉䎰䱒㍎䣗悓叱啛攻灋缊绩邕翑筬ꅹ硲鰴끵鑰鏰逐蒰翯頑耰鐗脰沴泸捉寲琱䠑椻壘끚鞉뀴道猋缪냿葏ꎱ";

        public static void Encode(float[] data, float range)
        {
            byte ConvertTo5b(float x)
            {
                return (byte)Math.Round(Math.Clamp(x / range * 15.5 + 15.5, 0, 31));
            }

            byte[] data_b = data.Select(ConvertTo5b).ToArray();

            byte[] encoded_data = new byte[data_b.Length];

            for(int i = 0; i < data_b.Length / 3; i++)
            {
                ushort us = (ushort) ((data_b[i * 3] << 10) | (data_b[i * 3 + 1] << 5) | data_b[i * 3 + 2]);
                Encode(us, encoded_data, i * 3);
                ushort us2 = Decode(encoded_data, i * 3);

                if (us != us2)
                    Console.WriteLine($"Error : {us:X}, {us2:X}");
            }

            string s = Encoding.UTF8.GetString(encoded_data);

            File.WriteAllText("codingame/encoded.txt", s);
        }

        public static void Encode(ushort i, byte[] dst, int offset)
        {
            if ((i & 0x8000) != 0)
                Console.WriteLine("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!");

            i += 0x4000;

            if (i >= 0xA000)
                i += 0x1000;

            dst[offset + 0] = (byte)(0xE0 | (i >> 12));
            dst[offset + 1] = (byte)(0x80 | ((i >> 6) & 0b111111));
            dst[offset + 2] = (byte)(0x80 | (i & 0b111111));
        }

        public static ushort Decode(byte[] src, int offset)
        {
            byte b1 = src[offset];
            byte b2 = src[offset + 1];
            byte b3 = src[offset + 2];

            ushort i = (ushort)(((b1 & 0xF) << 12) | ((b2 & 0b111111) << 6) | (b3 & 0b111111));

            if (i >= 0xB000)
                i -= 0x1000;

            i -= 0x4000;

            return i;
        }
    }
}
